docs/1c-export-2026-06-02/Documents/ИзменениеСостоянияМешка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ИзменениеСостоянияМешка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ІсторіяЗміниСтануМішка</xr:Item>
				<xr:Item>InformationRegister.Сектори</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коментар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Открыт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВидео</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Целевой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаYouTube</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>127</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бронь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодБрони</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ефір</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕфірНаДоставку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СекторНаСкладі</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/ІсторіяЗміниСтануМішка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ІсторіяЗміниСтануМішка</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Открыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВидео</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Целевой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаYouTube</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>127</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБрони</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ефір</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕфірНаДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекторНаСкладі</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Відповідальний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатури</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/Сектори.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Сектори</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сектор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сектори</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/ТипыДействийПриНапоминании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыДействийПриНапоминании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСтарыхЗаказов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжениеБрониТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщенияВайберОВидео</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Documents/ИзменениеСостоянияМешка/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЭтоНовый() И Дата < НачалоДня(ТекущаяДата()) Тогда 
		Отказ = Истина;
		Предупреждение("Можна міняти лише сьогоднышный документ. Створіть новий!");
	КонецЕсли;
	
	
	Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Intrata                                           ") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда 
		Для Каждого Строка Из Товары Цикл
			
			БылоВидеоДоЗаписи = Строка.ХарактеристикаНоменклатуры.ЕстьВидео;
		
			Объект 				   = Строка.ХарактеристикаНоменклатуры.Ссылка.ПолучитьОбъект();
			Объект.ЕстьВидео 	   = Строка.ЕстьВидео;
			Объект.Открыт 		   = Строка.Открыт;
			Объект.Целевой         = Строка.Целевой;
			Объект.СсылкаНаYouTube = Строка.СсылкаНаYouTube;
			Объект.Описание        = Строка.Описание;
			Объект.Бронь           = Строка.Бронь;
			Объект.ПериодБрони     = КонецДня(Строка.ПериодБрони);
			Объект.Контрагент      = Строка.Контрагент;
			Объект.СекторНаСкладі  = Строка.СекторНаСкладі;
			Объект.Коментар		   = Строка.Коментар;
			Объект.Ефір            = Строка.Ефір;
			Объект.ЕфірНаДоставку  = Строка.ЕфірНаДоставку;
			
			ОбЪект.Записать();  			
			
			Если Строка.ЕстьВидео Тогда
				Если Не БылоВидеоДоЗаписи Тогда
					Если ЗначениеЗаполнено(Строка.Контрагент) Тогда		
						Если ЗначениеЗаполнено(Строка.Бронь) Тогда							
							ЗаписьОчереди = РегистрыСведений.ОчередьНапоминанийСДействием.СоздатьМенеджерЗаписи();
							ЗаписьОчереди.ТорговыйАгент = Строка.Бронь;
							ЗаписьОчереди.КонтрагентДляДействий	= Строка.Контрагент;							
							ЗаписьОчереди.ХарактеристикаДляДействий = Строка.ХарактеристикаНоменклатуры;
							ЗаписьОчереди.ТипДействяПриНапоминании = Перечисления.ТипыДействийПриНапоминании.ОтправкаСообщенияВайберОВидео;
							ЗаписьОчереди.ПериодДобавления = ТекущаяДата();
							ЗаписьОчереди.Записать();
							ТекстСообщения = "Додано нагадування що з'явилось відео по " + Строка(Строка.Бронь) + " артикулу " + Строка(Строка.ХарактеристикаНоменклатуры.Владелец.Артикул) + " мішка " + Строка(Строка.ХарактеристикаНоменклатуры) + " на контрагента " + Строка(Строка.Контрагент);
							Сообщить(ТекстСообщения); 
   							ЗаписьЖурналаРегистрации("Добавлено нагадування", УровеньЖурналаРегистрации.Информация,,,ТекстСообщения, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);							
						КонецЕсли;	
					КонецЕсли; 					
				КонецЕсли;	
			КонецЕсли;	
			
			
		КонецЦикла;		
	    Проведен = Истина;
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Intrata                                           ") Тогда
		Возврат;
	КонецЕсли;

	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
		Движения.ІсторіяЗміниСтануМішка.Записывать = Истина;
		Движения.ІсторіяЗміниСтануМішка.Очистить();
		Для Каждого Ряд Из Товары Цикл
			Рух = Движения.ІсторіяЗміниСтануМішка.Добавить();
			Рух.Активность = Истина;
			Рух.Период = ТекущаяДата();
			Рух.Бронь = Ряд.Бронь;
			Рух.ЕстьВидео = Ряд.ЕстьВидео;
			Рух.Ефір = Ряд.Ефір;
			Рух.ЕфірНаДоставку = Ряд.ЕфірНаДоставку;
			Рух.Коментар = Ряд.Коментар;
			Рух.Контрагент = Ряд.Контрагент;
			Рух.Описание = Ряд.Описание;
			Рух.Открыт = Ряд.Открыт;
			Рух.ПериодБрони = Ряд.ПериодБрони;
			Рух.Регистратор = Ссылка;
			Рух.СекторНаСкладі = Ряд.СекторНаСкладі;
			Рух.СсылкаНаYouTube = Ряд.СсылкаНаYouTube;
			Рух.ХарактеристикаНоменклатури = Ряд.ХарактеристикаНоменклатуры;
			Рух.Целевой = Ряд.Целевой;
			Рух.Штрихкод = Ряд.Штрихкод;
			Рух.Дата = Дата;
			Рух.Відповідальний = ПараметрыСеанса.ТекущийПользователь;
		КонецЦикла;
		Движения.ІсторіяЗміниСтануМішка.Записать();

	
		// Сектори
	Движения.Сектори.Записывать = Истина;
	Движения.Сектори.Очистить();

	Для Каждого Стр Из Товары Цикл
			Если ПустаяСтрока(Стр.СекторНаСкладі) Тогда 
				Продолжить;
			КонецЕсли;

		Движение = Движения.Сектори.Добавить();
		Движение.Период = Дата;
		Движение.ХарактеристикаНоменклатуры = Стр.ХарактеристикаНоменклатуры;
		Движение.Сектор =  ОблікСекторів.ОтриматиСектор(Стр.СекторНаСкладі);
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Для Каждого Объект Из Товары Цикл
			Строка 				   = Объект.ХарактеристикаНоменклатуры;
			Объект.ЕстьВидео 	   = Строка.ЕстьВидео;
			Объект.Открыт 		   = Строка.Открыт;
			Объект.Целевой         = Строка.Целевой;
			Объект.СсылкаНаYouTube = Строка.СсылкаНаYouTube;
			Объект.Описание        = Строка.Описание;
			Объект.Бронь           = Строка.Бронь;
			Объект.ПериодБрони     = КонецДня(Строка.ПериодБрони);
			Объект.Контрагент      = Строка.Контрагент;
			Объект.СекторНаСкладі  = Строка.СекторНаСкладі;
			Объект.Коментар		   = Строка.Коментар;
			Объект.Ефір            = Строка.Ефір;
			Объект.ЕфірНаДоставку  = Строка.ЕфірНаДоставку;
	КонецЦикла;	
КонецПроцедуры
